artillery/smoke-test.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  # target: http://backend.dev.housingbayarea.int
  target: https://backend.dev.housingbayarea.mtc.ca.gov
  phases:
    - duration: 300
      arrivalRate: 1
      name: Warm up phase
    # - duration: 60
    #   arrivalRate: 5
    #   rampTo: 10
    #   name: Ramp up load
    # - duration: 30
    #   arrivalRate: 10
    #   rampTo: 30
    #   name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
    expect: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 2000
      - http.response_time.p95: 1000
scenarios:
  # Approximately 60% of all VUs will run this scenario.
  - name: get all listings
    weight: 6
    flow:
      - get:
          url: /listings
  # Approximately 30% of all VUs will run this scenario.
  - name: get an individual listing
    weight: 3
    flow:
      - get:
          url: /listings/9fdb7bb5-e8e8-48fa-ad35-50f46fe58c75
  # Approximately 10% of all VUs will run this scenario.
  - name: Apply for listing
    weight: 1
    flow:
      - get:
          url: /listings/9fdb7bb5-e8e8-48fa-ad35-50f46fe58c75