artillery/stress-test.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  # target: http://backend.dev.housingbayarea.int
  target: "{{ $env.URL }}"
  processor: lib/fake-app-for-artillery.ts
  payload:
    path: "users.csv"
    fields:
      - "email"
      - "password"
  phases:
    - duration: 300
      arrivalRate: 1
      maxVusers: 10
      name: Normal Load for Listing Release
    - duration: 1800
      arrivalRate: 20
      name: Double the load
    - duration: 1800
      arrivalRate: 30
      name: triple the load
    # - duration: 1h
    #   arrivalRate: 2
    #   name: First Hour
    # - duration: 6h
    #   arrivalRate: 3
    #   name: Bulk of test
  # # Load & configure a couple of useful plugins
  # # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
    expect: {}
    fake-data: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 4000
      - http.response_time.p95: 2000
  variables:
    url: "{{ $env.URL }}"
    listingId: "{{ $env.LISTING }}"
scenarios:
  # Approximately 60% of all VUs will run this scenario.
  - name: get all listings
    weight: 5
    flow:
      - post:
          url: /listings/list
          expect:
            - statusCode: 201
  # # Approximately 30% of all VUs will run this scenario.
  - name: get an individual listing
    weight: 4
    flow:
      - get:
          url: /listings/{{ listingId }}
          expect:
            - statusCode: 200
  # Approximately 10% of all VUs will run this scenario.
  - name: Apply for listing
    weight: 2
    flow:
      - get:
          url: /listings/{{ listingId }}
          expect:
            - statusCode: 200
      - post:
          url: /auth/login
          json:
            email: "{{ email }}"
            password: "{{ password }}"
            expect:
              - statusCode: 200
      - post:
          url: /applications
          beforeRequest:
            - generateApplication
          capture:
            json: $.body
            as: body
          log: "{{ body }}"
          expect:
            - statusCode: 201